app/controllers/users_controller.rb

  def index
    @users = User.search(params[:search]).paginate(:per_page => 10, :page => params[:page])
---
SELECT * FROM `users`

  def class_information
    user_id = params[:user_id]
    @user = User.find(user_id)
    @class_information = ClassInformation.find(:all, :conditions => "user_id = #{user_id}")
---
SELECT * FROM `users` WHERE (`users`.`id` = 57)
SELECT * FROM `class_informations` WHERE (user_id = 57)

  def create
    @user = User.new(params[:user])
    @credits = 0
    @time_range = []

    (1..7).each do |i|
      class_info = params[:"class_information#{i}"]
      unless class_info.values.all?{|i| i.empty?}
        @class_information = ClassInformation.new(class_info)
        @user.class_information << @class_information
---
INSERT INTO `class_informations` (`updated_at`, `title`, `section_number`, `stop_time`, `day`, `credits`, `user_id`, `class_number`, `start_time`, `created_at`) VALUES('2010-12-20 07:21:58', 'asdad', '1', '2000-01-01 08:00:00', 'Mon', 1, 57, 'sfsf', '2000-01-01 08:00:00', '2010-12-20 07:21:58')
INSERT INTO `users` (`updated_at`, `host_institution`, `first_name`, `last_name`, `stony_brook_id`, `created_at`) VALUES('2010-12-20 07:21:58', 'test', 'testssfsfasd', 'test', 'tes', '2010-12-20 07:21:58')